{"keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "filters": 32, "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "use_bias": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "filters": 32, "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "use_bias": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "filters": 64, "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "use_bias": true, "padding": "valid", "activity_regularizer": null, "bias_constraint": null, "filters": 64, "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "units": 512, "name": "dense_1", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "units": 10, "name": "dense_2", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_6"}}]}