{"class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 32, "activation": "linear", "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "name": "conv2d_1", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 32, 32, 3], "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "dtype": "float32", "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "bias_constraint": null, "name": "dense_1", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "units": 512, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "bias_constraint": null, "name": "dense_2", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "units": 10, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "softmax", "trainable": true}}]}