{"keras_version": "2.0.6", "config": [{"config": {"bias_constraint": null, "name": "conv2d_1", "data_format": "channels_last", "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "filters": 32, "padding": "same", "batch_input_shape": [null, 32, 32, 3], "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "name": "dense_1", "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 512, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "name": "dense_2", "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 10, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}