{"config": [{"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "batch_input_shape": [null, 32, 32, 3], "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "activation": "linear", "dtype": "float32", "dilation_rate": [1, 1], "activity_regularizer": null, "name": "conv2d_1", "filters": 32}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_2", "filters": 32}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_3", "filters": 64}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_4", "filters": 64}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 512, "activity_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 10, "activity_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}], "keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential"}